package school.faang.BJS2_31682;

public class RareBookStoreTwo {
    //Условия задачи
    //Продолжим создавать новый сервис — платформу для онлайн-продажи редких книг.
    //
    //Разработка
    //
    //Создайте отдельную ветку для добавления служебных файлов в наш репозиторий. Важно дать ей понятное название;
    //
    //Добавьте файлы .gitignore (нужно найти подходящий шаблон для Java, чтобы утильные папки
    // .idea, build и другие не добавлялись в индекс);
    //
    //Добавьте README файл с описанием проекта;
    //
    //Добавьте файлы в индекс и сделайте первый коммит. Важно написать информативное и понятное описание к коммиту;
    //
    //Загрузим эту ветку на удаленный репозиторий.
}
