Условия задачи

Вы являетесь командующим армией героев меча и магии. Ваша задача состоит в том, чтобы определить силу армии,
состоящей из различных подразделений, таких как лучники, мечники, маги и т.д. Поскольку ваша армия огромна,
вам необходимо распределить задачу расчёта общей силы среди нескольких потоков.

Цель: Напишите программу, которая моделирует армию героев меча и магии и определяет общую силу армии с использованием распараллеливания.

Требования:

Создайте классы Archer, Swordsman, Mage и дополнительные классы для других подразделений армии, если требуется.
Все эти классы должны иметь поле power для хранения силы каждого бойца.

Создайте класс Army, который содержит список всех подразделений, а также метод calculateTotalPower(),
который вычисляет общую силу армии.

В calculateTotalPower() используйте распараллеливание для вычисления суммарной силы каждого подразделения и общей силы армии.
Т.е. этот метод в отдельном потоке считает силу каждого отдельного отряда. См. пример. По сути,
прямо сейчас там нет никакой выдающейся формулы. Каждый отдельный поток просто будет добавлять само поле power объекта, который ему выдан, вот и всё.

Для создания потоков просто используйте класс Thread. Можете создать своего собственного наследника этого класса для удобного хранения данных.

Внешняя синхронизация не должна использоваться, только внутренняя механика распараллеливания.
ВАЖНО: если вы уже знакомы с темой синхронизации, то можете использовать.
Если же ещё ничего не слышали про слово synchronized или не знаете пока, как правильно им пользоваться,
то делаем без него! Цель здесь — именно научиться запускать потоки и распараллеливать работу. Потенциальные проблемы синхронизации мы будем решать позже!

Пример использования:

Army army = new Army();
army.addUnit(new Archer(25)); // считаем в потоке 1
army.addUnit(new Swordsman(40)); // считаем в потоке 2
army.addUnit(new Mage(50)); // считаем в потоке 3
army.addUnit(new Mage(20)); // считаем в потоке 4

int totalPower = army.calculateTotalPower();
System.out.println("Total army power: " + totalPower);