package school.faang.BJS2_32021;

public class RareBookStore {
    //Условия задачи
    //Давайте представим, что вы работаете в большой технологической компании и вам была поручена задача
    // создать новый сервис — платформу для онлайн-продажи редких книг.
    //
    //Создание репозитория:
    //
    //Создайте удалённый Git-репозиторий на платформе хостинга GitHub;
    //
    //Затем клонируйте в локальную среду разработки для начала работы над проектом;
    //
    //Попробуйте сделать второй вариант: создайте новый Git-репозиторий в Intellij IDEA.
    // После этого, используя вкладку Git, выберете пункт меню Github, и выберете Share Project On GitHub.

    //Уважаемый думаю факт того что я уже склонировал этот реп-й считаетсявыполнением данной задачи.
}
