package school.faang.BJS2_31792;

public class RareBookStoreFive {
    //Условия задачи
    //Продолжим создавать новый сервис - платформу для онлайн-продажи редких книг.
    //
    //Релиз
    //
    //Сделаем PR (pull request) ветки с файлами .gitignore и README в главную ветку;
    //
    //Сделаем Approve. Наша ветка должна слиться с веткой main. Также сделайте так,
    // чтобы после слияния ваша рабочая ветка была удалена;
    //
    //Создадим PR ветки feature-b в главную ветку. Если будут конфликты, их нужно исправить в
    // локальном репозитории и загрузить на удалённый репозиторий, чтобы ничего не мешало слиянию;
    //
    //Попробуйте написать комментарий в PR к любой строчке в документе App.java (потренируемся делать код-ревью);
    //
    //Подтвердим PR и зальем изменения в главную ветку.
}
