package faang.school.godbless.meta_universe;

public class NotificationManager {

//    Создайте класс NotificationManager с методами: registerHandler:
//    принимает идентификатор оповещения и функциональный интерфейс (например, Consumer<Notification>),
//    добавляет пару ключ-значение в Map;sendNotification: принимает объект типа Notification и вызывает
//    соответствующий обработчик оповещения из Map.

//    Создайте несколько обработчиков оповещений, используя лямбда-выражения и стандартные функциональные интерфейсы Java;

//    Подумайте, как ещё вы могли бы расширить эту систему,
//    с помощью других коллекций обработчиков с дополнительными функциональными интерфейсами.
//   Возможно, вы могли бы создать Map из фильтров содержания нотификаций, чтобы обнаруживать неприемлемый контент.
//   А, возможно, даже обработчики, затем корректирующие этот контент с помощью Function…
//   В Meta от вас ждут инициативности и находчивости в разработке собственных креативных решений.
//   Этот пункт мы оставили специально свободным для вас, чтобы вы могли воплощать свои идеи!


}
