package school.faang.they_were_very_nice_but_extremely_poor;

public class WeasleyFamily {

    String[] chores = {
            "Помыть посуду руками",
            "Включить посудомоечную машину",
            "Подмести пол",
            "Включить робот-пылесос для влажной уборки",
            "Приготовить ужин",
            "Полить цветы",
            "Вынести мусор",
            "Помыть окна на балконе",
            "Заправить кровать",
            "Собрать накопившиеся вещи",
            "Запустить стиральную машину",
            "Погулять с собакой Тедди"
    };
}
