package school.faang.Mnogopotochka.ParallelismThread.BJS2_36706;

public class WeasleyFamily {
    public static final String[] chores = {
            "помыть посуду",
            "подмести пол",
            "приготовить ужин",
            "постирать белье",
            "погладить одежду",
            "выгулять собаку",
            "полить цветы",
            "сходить в магазин",
            "убрать в комнате",
            "почистить окна",
            "вынести мусор",
            "приготовить завтрак",
            "почистить ванную",
            "пропылесосить ковры",
            "помыть машину",
            "сделать домашнее задание",
            "помыть полы",
            "приготовить обед",
            "помыть холодильник",
            "организовать шкаф"
    };
}
